cask_args appdir: '/Applications'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'caskroom/cask'
tap 'caskroom/versions'
brew 'mas'
brew 'coreutils'  # Required for .bash_prompt
brew 'tmux'
brew 'tree'
brew 'docker-compose', args: ['--without-docker', '--without-docker-machine']
brew 'svtplay-dl'
brew 'youtube-dl'
cask 'visual-studio-code'
cask 'visual-studio-code-insiders'
cask 'telegram'
cask 'google-chrome'
cask 'sublime-text'
cask 'miniconda'
cask 'parallels-desktop11'
cask 'gitkraken'
cask 'spotify'
cask 'transmit'
cask 'docker'
cask 'appcleaner'
cask 'gitter'
cask 'slack'
cask 'qt-creator'
cask 'microsoft-remote-desktop-beta'
# cask '1password'
# cask 'little-snitch'
# cask 'sketchup'
# cask 'arq'
mas '1Password', id: 443987910
mas 'Keka', id: 470158793
mas 'Wunderlist', id: 410628904
mas 'Pixelmator', id: 407963104
# mas 'Battery Health 2', id: 1120214373
mas 'Xcode', id: 497799835  # Slow download/install!
