# Manually install using "brew cask install xxx --appdir=/Applications"

cask_args appdir: '/Applications'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'caskroom/cask'
tap 'caskroom/versions'
brew 'mas'
brew 'coreutils'  # Required for .bash_prompt
brew 'vim'
brew 'neovim'
brew 'tmux'
brew 'mosh'
brew 'wget'
brew 'tree'
brew 'htop'
brew 'docker-compose', args: ['--without-docker', '--without-docker-machine']
brew 'svtplay-dl'
brew 'youtube-dl'
brew 'cookiecutter'  # Requires password
cask 'visual-studio-code'
brew 'ctags'
# cask 'visual-studio-code-insiders'
cask 'telegram'
cask 'google-chrome'
cask 'sublime-text'
cask 'parallels-desktop11'
cask 'gitkraken'
cask 'spotify'
cask 'transmit'
cask 'docker'
cask 'appcleaner'
cask 'gitter'
cask 'slack'
cask 'qt-creator'
cask 'remote-play'
# cask 'iterm2'
cask 'powershell'
# cask '1password'
# cask 'little-snitch'
# cask 'sketchup'
# cask 'arq'
cask 'zenmapgit'
mas '1Password', id: 443987910
mas 'Keka', id: 470158793
mas 'Wunderlist', id: 410628904
mas 'Pixelmator', id: 407963104
mas 'Microsoft Remote Deskop', id: 715768417
mas 'Better Rename 9', id: 414209656
# mas 'Battery Health 2', id: 1120214373
mas 'Xcode', id: 497799835  # Slow download/install!
