alefragnani.project-manager
alexcvzz.vscode-sqlite
apollographql.vscode-apollo
asvetliakov.vscode-neovim
bierner.emojisense
bierner.github-markdown-preview
bierner.markdown-checkbox
bierner.markdown-emoji
bierner.markdown-footnotes
bierner.markdown-mermaid
bierner.markdown-preview-github-styles
bierner.markdown-yaml-preamble
budparr.language-hugo-vscode
catppuccin.catppuccin-vsc
catppuccin.catppuccin-vsc-icons
charliermarsh.ruff
christian-kohler.path-intellisense
codezombiech.gitignore
cweijan.vscode-autohotkey-plus
dbaeumer.vscode-eslint
eamodio.gitlens
emeraldwalk.runonsave
enkia.tokyo-night
esbenp.prettier-vscode
foxundermoon.shell-format
github.copilot-chat
github.vscode-github-actions
github.vscode-pull-request-github
golang.go
graphql.vscode-graphql
graphql.vscode-graphql-execution
graphql.vscode-graphql-syntax
gruntfuggly.todo-tree
hashicorp.terraform
hbenl.vscode-test-explorer
humao.rest-client
jasonnutter.vscode-codeowners
malmaud.tmux
mhutchie.git-graph
mikestead.dotenv
mohsen1.prettify-json
ms-azuretools.vscode-docker
ms-kubernetes-tools.vscode-kubernetes-tools
ms-python.debugpy
ms-python.isort
ms-python.mypy-type-checker
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.live-server
ms-vscode.makefile-tools
ms-vscode.remote-explorer
ms-vscode.remote-server
ms-vscode.test-adapter-converter
ms-vsliveshare.vsliveshare
mtxr.sqltools
naumovs.color-highlight
nickmillerdev.pytest-fixtures
pnp.polacode
qezhu.gitlink
rangav.vscode-thunder-client
redhat.vscode-commons
redhat.vscode-yaml
rust-lang.rust-analyzer
ryanluker.vscode-coverage-gutters
shardulm94.trailing-spaces
shopify.ruby-lsp
sidneys1.gitconfig
sumneko.lua
tamasfe.even-better-toml
timonwong.shellcheck
tldraw-org.tldraw-vscode
vadimcn.vscode-lldb
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
wayou.vscode-todo-highlight
wholroyd.jinja
wicked-labs.wvsc-serendipity
yzhang.markdown-all-in-one
zxh404.vscode-proto3
