# Usage:
# brew bundle --file=path/to/Brewfile

# Manually install cask-app using: brew install --cask xxx --appdir /Applications
cask_args appdir: '/Applications'

# Taps (third-party repositories)
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/cask-fonts'
tap 'cantino/mcfly'
tap 'koekeishiya/formulae' # yabai
tap 'oven-sh/bun'

# system
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'
brew 'yabai'
brew 'skhd'
cask 'karabiner-elements'

# fonts
cask 'font-jetbrains-mono-nerd-font'
cask 'font-symbols-only-nerd-font'
cask 'font-noto-color-emoji'
cask 'font-noto-emoji'

# terminal cli tools
brew 'bash'
brew 'starship'
brew 'gh'
brew 'nvm'
brew 'asciinema'
brew 'pre-commit'
brew 'tree'
brew 'mcfly'
brew 'eza'
brew 'bat'
brew 'withgraphite/tap/graphite'
brew 'kubectx'
brew 'zoxide'
brew 'circumflex'
brew 'ollama'

# slides
brew 'slides'
brew 'chafa'

# languages
brew 'rustup-init'
brew 'go'
brew 'bun'
brew 'ruby'

# tmux
brew 'tmux'
brew 'tmuxinator'

# neovim
brew 'neovim'
brew 'ripgrep'
brew 'fd'
brew 'lazygit'
brew 'fzf'
brew 'gnu-sed'  # spectre

# ui apps
cask '1password'
cask 'appcleaner'
cask 'wezterm'
cask 'visual-studio-code'
cask 'pgadmin4'
cask 'spotify'
cask 'airbuddy'

# other casks
cask 'google-cloud-sdk'
cask '1password-cli'
