# Usage:
# brew bundle --file=path/to/Brewfile

# Manually install cask-app using: brew install --cask xxx --appdir /Applications
cask_args appdir: '/Applications'

# Taps (third-party repositories)
tap 'homebrew/cask-fonts'
tap 'koekeishiya/formulae' # yabai

# system
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'
brew 'yabai'
brew 'skhd'
#cask 'karabiner-elements'  # requires password

# fonts
cask 'font-jetbrains-mono'
cask 'font-jetbrains-mono-nerd-font'
cask 'font-symbols-only-nerd-font'
cask 'font-noto-color-emoji'
cask 'font-noto-emoji'

# terminal cli tools
brew 'asciinema'
brew 'atuin'
brew 'bash'
brew 'bat'
brew 'direnv'
brew 'eza'
brew 'gh'
brew 'go-task/tap/go-task'
brew 'grpcurl'
brew 'jq'
brew 'ollama'
brew 'pkgxdev/made/pkgx'
brew 'pre-commit'
brew 'starship'
brew 'tree'
brew 'withgraphite/tap/graphite'
brew 'yq'
brew 'zoxide'

# slides
brew 'slides'
brew 'chafa'

# tmux
brew 'tmux'
brew 'tmuxinator'

# neovim
brew 'neovim'
brew 'cmake'
brew 'gcc'
brew 'make'
brew 'ripgrep'
brew 'fd'
brew 'lazygit'
brew 'fzf'
brew 'gnu-sed'  # spectre
brew 'shellcheck'  # mason installs intel version
brew 'hadolint'  # mason installs intel version

# k8s
brew 'helm'
brew 'k9s'
brew 'kind'
brew 'kubectl'
brew 'kubectx'
brew 'linkerd'
brew 'minikube'
brew 'opentofu'  # terraform
brew 'podman'
brew 'podman-compose'
brew 'stern'
cask 'podman-desktop'

# gcloud
cask 'google-cloud-sdk'
brew 'cloud-sql-proxy'

# databases
brew 'postgresql'  # provides psql
cask 'pgadmin4'
brew 'mysql-client'  # provides mysql

# ui apps
cask 'appcleaner'
cask 'wezterm'
cask 'visual-studio-code'
cask 'spotify'
cask 'obsidian'
cask 'signal'


