4ops.terraform
alefragnani.project-manager
alexcvzz.vscode-sqlite
apollographql.vscode-apollo
arcticicestudio.nord-visual-studio-code
bierner.emojisense
bierner.github-markdown-preview
bierner.markdown-checkbox
bierner.markdown-emoji
bierner.markdown-footnotes
bierner.markdown-mermaid
bierner.markdown-preview-github-styles
bierner.markdown-yaml-preamble
bungcip.better-toml
christian-kohler.path-intellisense
codezombiech.gitignore
cschleiden.vscode-github-actions
cweijan.vscode-autohotkey-plus
dbaeumer.vscode-eslint
eamodio.gitlens
eppz.eppz-code
Equinusocio.vsc-material-theme
equinusocio.vsc-material-theme-icons
esbenp.prettier-vscode
foxundermoon.shell-format
freakypie.code-python-isort
GitHub.github-vscode-theme
GitHub.vscode-pull-request-github
golang.go
GraphQL.vscode-graphql
johnpapa.vscode-peacock
malmaud.tmux
MarkLarah.pre-commit-vscode
mhutchie.git-graph
miguelsolorio.fluent-icons
mikestead.dotenv
mohsen1.prettify-json
ms-azuretools.vscode-docker
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.live-server
ms-vscode.vscode-typescript-tslint-plugin
ms-vsliveshare.vsliveshare
ms-vsliveshare.vsliveshare-audio
ms-vsliveshare.vsliveshare-pack
mtxr.sqltools
naumovs.color-highlight
nickmillerdev.pytest-fixtures
pawelgrzybek.gatito-theme
pnp.polacode
qezhu.gitlink
redhat.vscode-commons
redhat.vscode-yaml
rust-lang.rust
shardulm94.trailing-spaces
sidneys1.gitconfig
sourcery.sourcery
timonwong.shellcheck
VisualStudioExptTeam.vscodeintellicode
VisualStudioExptTeam.vscodeintellicode-completions
vsls-contrib.gistfs
wart.ariake-dark
WasiMaster.typesplainer
wayou.vscode-todo-highlight
wholroyd.jinja
wicked-labs.old-serendipity
wicked-labs.wvsc-serendipity
yzhang.markdown-all-in-one
zxh404.vscode-proto3
