# Usage:
# brew bundle --file=path/to/Brewfile

# Taps (third-party repositories)
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/linux-fonts'
tap 'withgraphite/tap'
tap 'cantino/mcfly'

# system
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

# fonts
cask 'font-jetbrains-mono-nerd-font'
cask 'font-symbols-only-nerd-font'
cask 'font-noto-color-emoji'
cask 'font-noto-emoji'

# terminal cli tools
brew 'starship'
brew 'gh'
brew 'asciinema'
brew 'pre-commit'
brew 'tree'
brew 'cantino/mcfly/mcfly'
brew 'eza'
brew 'bat'
brew 'withgraphite/tap/graphite'
brew 'kubectx'
brew 'zoxide'
brew 'ollama'
brew 'pkgxdev/made/pkgx'

# slides
brew 'slides'
brew 'chafa'

# tmux
brew 'tmux'
brew 'tmuxinator'

# neovim
brew 'neovim'
brew 'ripgrep'
brew 'fd'
brew 'lazygit'
brew 'fzf'
brew 'gnu-sed'  # spectre
brew 'pkg-config'  # gh-actions.nvim
brew 'node'  # various LSPs like prettier, pyright

# other casks
cask 'google-cloud-sdk'
