# Usage:
# brew bundle --file=path/to/Brewfile

# Taps (third-party repositories)
tap 'homebrew/bundle'
# tap 'homebrew/core'
tap 'homebrew/linux-fonts'
tap 'withgraphite/tap'
tap 'cantino/mcfly'
tap 'oven-sh/bun'

# system

# fonts
cask 'font-jetbrains-mono-nerd-font'
cask 'font-symbols-only-nerd-font'
cask 'font-noto-color-emoji'
cask 'font-noto-emoji'

# terminal cli tools
brew 'starship'
brew 'gh'
brew 'nvm'
brew 'asciinema'
brew 'pre-commit'
brew 'tree'
brew 'mcfly'
brew 'eza'
brew 'bat'
brew 'graphite'
brew 'kubectx'
brew 'zoxide'

# slides
brew 'slides'
brew 'chafa'

# languages
brew 'rustup-init'
brew 'go'
brew 'bun'
brew 'ruby'

# tmux
brew 'tmux'
brew 'tmuxinator'

# neovim
brew 'neovim'
brew 'ripgrep'
brew 'fd'
brew 'lazygit'
brew 'fzf'
brew 'gnu-sed'  # spectre
brew 'pkg-config'  # gh-actions.nvim
brew 'node'  # various LSPs like prettier, pyright

# other casks
cask 'google-cloud-sdk'
